app/views/devise/registrations/new.html.erb

        <div class="col-md-6">
          <%= f.input :g_tipo_usuario_id, label: "Tipo de Usuário", required: true, collection: GTipoUsuario.all, prompt: "Selecione o tipo de usuário", label_method: :descricao, value_method: :id %>
---
SELECT "g_tipo_usuarios".* FROM "g_tipo_usuarios"

        <div class="col-md-6">
          <%= f.input :e_empresa_id, label: "Empresa", required: true, collection: EEmpresa.all, prompt: "Selecione a empresa", label_method: :nome_fantasia, value_method: :id %>
---
SELECT "e_empresas".* FROM "e_empresas"