app/views/g_bairros/_form.html.erb

SELECT "g_cidades".* FROM "g_cidades" ORDER BY "g_cidades"."nome_fantasia" ASC
---
        <div class="col-12">
          <%= f.input :g_cidade_id, collection: GCidade.all.order(:nome_fantasia), label_method: :nome_fantasia, value_method: :id,prompt: "Selecione a cidade",input_html: { class: "capitalize" }%>