app/views/e_clientes/_form.html.erb

        <%= f.input :possui_representante_legal, as: :boolean, label: "Possui representante legal?" %>
        <%= f.association :g_sexo,   collection:   GSexo.all, label_method: :descricao, value_method: :id, prompt: "Selecione o sexo" %>
        <%= f.association :g_estado, collection: GEstado.all, label_method: :nome_fantasia, value_method: :id, prompt: "Selecione o estado" %>
        <%= f.association :g_cidade, collection: GCidade.all, label_method: :nome_fantasia, value_method: :id, prompt: "Selecione a cidade" %>
        <%= f.association :g_bairro, collection: GBairro.all, label_method: :descricao, value_method: :id, prompt: "Selecione o bairro" %>
        <%= f.association :g_orgao, collection:  GOrgao.all, label_method: :descricao, value_method: :id, prompt: "Selecione o órgão" %>
        <%= f.association :g_margem_tipo, collection: GMargemTipo.all, label_method: :descricao, value_method: :id, prompt: "Selecione o tipo de margem" %>
        <%= f.association :g_tipo_beneficio, collection: GTipoBeneficio.all, label_method: :descricao, value_method: :id, prompt: "Selecione o tipo de benefício" %>
        <%= f.association :g_status_cliente, collection: GStatusCliente.all, label_method: :descricao, value_method: :id, prompt: "Selecione o status do cliente" %>
---
SELECT "g_sexos".* FROM "g_sexos"
SELECT "g_estados".* FROM "g_estados"
SELECT "g_cidades".* FROM "g_cidades"
SELECT "g_bairros".* FROM "g_bairros"
SELECT "g_orgaos".* FROM "g_orgaos"
SELECT "g_margem_tipos".* FROM "g_margem_tipos"
SELECT "g_tipo_beneficios".* FROM "g_tipo_beneficios"
SELECT "g_status_clientes".* FROM "g_status_clientes"