app/views/e_clientes/_form.html.erb

        <%= f.input :data_nascimento, as: :date %>
        <%= f.association :g_sexo, collection: GSexo.all, label_method: :descricao, value_method: :id, prompt: "Selecione o sexo" %>
---
SELECT "g_sexos".* FROM "g_sexos"

        <%= f.input :endereco, placeholder: "Endereço" %>
        <%= f.input :g_estado_id, collection: GEstado.all, label_method: :nome_fantasia, value_method: :id, prompt: "Selecione o estado" %>
        <%= f.input :g_cidade_id, collection: GCidade.all, label_method: :nome_fantasia, value_method: :id, prompt: "Selecione a cidade" %>
        <%= f.input :g_bairro_id, collection: GBairro.all, label_method: :descricao, value_method: :id, prompt: "Selecione o bairro" %>
---
SELECT "g_estados".* FROM "g_estados"
SELECT "g_cidades".* FROM "g_cidades"
SELECT "g_bairros".* FROM "g_bairros"

        <%= f.input :matricula, placeholder: "Matrícula" %>
        <%= f.input :g_orgao_id, collection: GOrgao.all, label_method: :descricao, value_method: :id, prompt: "Selecione o órgão", input_html: { id: "g_orgao_select" } %>
        <%= f.input :g_margem_tipo_id, collection: GMargemTipo.all, label_method: :descricao, value_method: :id, prompt: "Selecione o tipo de margem" %>
---
SELECT "g_orgaos".* FROM "g_orgaos"
SELECT "g_margem_tipos".* FROM "g_margem_tipos"