app/controllers/e_clientes_controller.rb

INSERT INTO "e_clientes" ("e_empresa_id", "nome_completo", "cpf", "data_nascimento", "email", "telefone", "nome_social", "endereco", "matricula", "alfabetizado", "ultima_margem", "data_ultima_margem", "ano_admissao", "pensionista", "numero_beneficio", "possui_representante_legal", "created_by", "updated_by", "deleted_at", "g_sexo_id", "g_estado_id", "g_cidade_id", "g_bairro_id", "g_orgao_id", "g_margem_tipo_id", "g_tipo_beneficio_id", "g_status_cliente_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24, $25, $26, $27, $28, $29) RETURNING "id"
---
  def create
    @e_cliente = current_user.e_empresa.e_clientes.new(e_cliente_params)

    if @e_cliente.save

SELECT "e_clientes".* FROM "e_clientes" WHERE "e_clientes"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
SELECT "e_empresas".* FROM "e_empresas" WHERE "e_empresas"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_e_cliente
    @e_cliente = current_user.e_empresa.e_clientes.find_by(id: params[:id])