app/controllers/e_clientes_controller.rb

SELECT "e_clientes".* FROM "e_clientes" WHERE "e_clientes"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
  def set_e_cliente
    @e_cliente = ECliente.find_by(id: params[:id])