app/controllers/e_empresas_controller.rb

INSERT INTO "e_empresas" ("razao_social", "cnpj", "endereco", "email", "telefone", "g_cidade_id", "created_by", "updated_by", "deleted_at", "created_at", "updated_at", "nome_fantasia") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
---
  def create
    @e_empresa = EEmpresa.new(e_empresa_params)

    if @e_empresa.save

UPDATE "e_empresas" SET "razao_social" = $1, "cnpj" = $2, "endereco" = $3, "email" = $4, "telefone" = $5, "g_cidade_id" = $6, "updated_at" = $7 WHERE "e_empresas"."id" = $8
---
  def update
    if @e_empresa.update(e_empresa_params)

SELECT "e_empresas".* FROM "e_empresas" WHERE "e_empresas"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_e_empresa
    @e_empresa = EEmpresa.find_by(id: params[:id])