app/controllers/g_bancos_controller.rb

  def create
    @g_banco = GBanco.new(g_banco_params)

    if @g_banco.save
---
INSERT INTO "g_bancos" ("nome_fantasia", "codigo", "created_by", "updated_by", "deleted_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"