app/controllers/g_cidades_controller.rb

  def create
    @g_cidade = GCidade.new(g_cidade_params)

    if @g_cidade.save
---
INSERT INTO "g_cidades" ("nome_fantasia", "g_estado_id", "created_by", "updated_by", "deleted_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"