app/controllers/g_estados_controller.rb

INSERT INTO "g_estados" ("nome_fantasia", "sigla", "created_by", "updated_by", "deleted_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @g_estado = GEstado.new(g_estado_params)

    if @g_estado.save