app/controllers/g_margem_tipos_controller.rb

  def create
    @g_margem_tipo = GMargemTipo.new(g_margem_tipo_params)

    if @g_margem_tipo.save
---
INSERT INTO "g_margem_tipos" ("descricao", "created_by", "updated_by", "deleted_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["descricao", "Cartão Beneficio"], ["created_by", nil], ["updated_by", nil], ["deleted_at", nil], ["created_at", "2025-09-08 22:03:51.440898"], ["updated_at", "2025-09-08 22:03:51.440898"]]