app/controllers/g_orgaos_controller.rb

  def create
    @g_orgao = GOrgao.new(g_orgao_params)

    if @g_orgao.save
---
INSERT INTO "g_orgaos" ("descricao", "created_by", "updated_by", "deleted_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["descricao", "Estado"], ["created_by", nil], ["updated_by", nil], ["deleted_at", nil], ["created_at", "2025-09-08 22:03:20.064600"], ["updated_at", "2025-09-08 22:03:20.064600"]]