app/controllers/g_sexos_controller.rb

  def create
    @g_sexo = GSexo.new(g_sexo_params)

    if @g_sexo.save
---
INSERT INTO "g_sexos" ("descricao", "created_by", "updated_by", "deleted_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["descricao", "Masculino"], ["created_by", nil], ["updated_by", nil], ["deleted_at", nil], ["created_at", "2025-09-06 17:10:35.410922"], ["updated_at", "2025-09-06 17:10:35.410922"]]