app/controllers/g_status_clientes_controller.rb

INSERT INTO "g_status_clientes" ("descricao", "created_by", "updated_by", "deleted_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["descricao", "Ativo"], ["created_by", nil], ["updated_by", nil], ["deleted_at", nil], ["created_at", "2025-09-08 22:04:32.197256"], ["updated_at", "2025-09-08 22:04:32.197256"]]
---
  def create
    @g_status_cliente = GStatusCliente.new(g_status_cliente_params)

    if @g_status_cliente.save