app/controllers/g_tipo_beneficios_controller.rb

  def create
    @g_tipo_beneficio = GTipoBeneficio.new(g_tipo_beneficio_params)

    if @g_tipo_beneficio.save
---
INSERT INTO "g_tipo_beneficios" ("descricao", "created_by", "updated_by", "deleted_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"